artillery.tests.yml
config:
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 2
      name: Ramp up the load slowly
  payload:
    path: './osuIds.csv'
    fields:
      - 'id'
    order: random
    skipHeader: true
  environments:
    development:
      target: http://api.dev
    production:
      target: http://api.prod
  variables:
    username: '{{ $processEnvironment.ARTILLERY_API_USER }}'
    password: '{{ $processEnvironment.ARTILLERY_API_PASSWORD }}'
scenarios:
  - name: As a student, visit the Home page
    flow:
      - get:
          url: '/login?username={{ username }}&password={{ password }}'
      - post:
          url: /api/masquerade
          json:
            masqueradeId: '{{ id }}'
      - get:
          url: /api/alerts
      - get:
          url: /api/alerts/dx
      - get:
          url: /api/student/class-schedule?term=current
      - get:
          url: /api/student/planner-items
      - get:
          url: /api/events/academic-calendar
      - get:
          url: /api/resources/category/featured
      - get:
          url: /api/resources/categories
      - get:
          url: /api/announcements
      - get:
          url: /api/events?type=115613&days=30
      - get:
          url: /api/user
      - get:
          url: /api/info-buttons
  - name: As a student, visit the Academics Dashboard page
    flow:
      - get:
          url: '/login?username={{ username }}&password={{ password }}'
      - post:
          url: /api/masquerade
          json:
            masqueradeId: '{{ id }}'
      - get:
          url: /api/student/class-schedule?term=current
      - get:
          url: /api/student/planner-items
      - get:
          url: /api/student/gpa
      - get:
          url: /api/student/academic-status
      - get:
          url: /api/student/academic-status
      - get:
          url: /api/student/holds
      - get:
          url: /api/events/academic-calendar
      - get:
          url: /api/resources/category/academic
      - get:
          url: /api/resources/categories
      - get:
          url: /api/announcements/academic
  - name: As a student, visit the Academics Academic History page
    flow:
      - get:
          url: '/login?username={{ username }}&password={{ password }}'
      - post:
          url: /api/masquerade
          json:
            masqueradeId: '{{ id }}'
      - get:
          url: /api/student/grades
      - get:
          url: /api/student/grades
  - name: As a student, visit the Resources page
    flow:
      - get:
          url: '/login?username={{ username }}&password={{ password }}'
      - post:
          url: /api/masquerade
          json:
            masqueradeId: '{{ id }}'
      - get:
          url: /api/resources/categories
      - get:
          url: /api/resources